order-service/old.xml

<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"  xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\" xmlns:msc=\"http://schemas.microsoft.com/ws/2005/12/wsdl/contract\" xmlns:tns=\"http://tempuri.org/\" xmlns:msb=\"http://schemas.microsoft.com/ws/06/2004/mspolicy/netbinary1\" xmlns:msf=\"http://schemas.microsoft.com/ws/2006/05/framing/policy\"><soap:Body><UpdateOrder xmlns=\"http://tempuri.org/\"><licenseCode>PizzaHutApp</licenseCode><language>en</language><conceptID>3</conceptID><order><q247:AddressID xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\">10525020</q247:AddressID><q247:ConceptID xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\">3</q247:ConceptID><q247:CountryID xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\">1</q247:CountryID><q247:CustomerID xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\">7699215</q247:CustomerID><q247:DeliveryChargeID xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\">279</q247:DeliveryChargeID><q247:DistrictID xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\">-1</q247:DistrictID><q247:Entries xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\"><q247:CEntry><q247:DealID>0</q247:DealID><q247:ID>0</q247:ID><q247:ItemID>911524</q247:ItemID><q247:ModCode>NONE</q247:ModCode><q247:Name>Mozzarella Burger Box</q247:Name><q247:QCComponent>1</q247:QCComponent><q247:QCInstanceID>723</q247:QCInstanceID><q247:QCLevel>0</q247:QCLevel><q247:QCProID>328</q247:QCProID></q247:CEntry><q247:CEntry><q247:DealID>0</q247:DealID><q247:ID>0</q247:ID><q247:ItemID>910001</q247:ItemID><q247:ModCode>NONE</q247:ModCode><q247:Name>Chicken Pc - Original</q247:Name><q247:QCComponent>2</q247:QCComponent><q247:QCInstanceID>723</q247:QCInstanceID><q247:QCLevel>0</q247:QCLevel><q247:QCProID>328</q247:QCProID></q247:CEntry><q247:CEntry><q247:DealID>0</q247:DealID><q247:Entries><q247:CEntry><q247:ID>0</q247:ID><q247:ItemID>810001</q247:ItemID><q247:ModCode>NONE</q247:ModCode><q247:ModgroupID>10028</q247:ModgroupID><q247:Name>American Cheese</q247:Name><q247:OrdrMode>OM_SAVED</q247:OrdrMode><q247:Weight>0</q247:Weight></q247:CEntry></q247:Entries><q247:ID>0</q247:ID><q247:ItemID>110035</q247:ItemID><q247:ModCode>NONE</q247:ModCode><q247:Name>Mozzarella Burger Sandwich Zinger</q247:Name><q247:QCComponent>3</q247:QCComponent><q247:QCInstanceID>723</q247:QCInstanceID><q247:QCLevel>0</q247:QCLevel><q247:QCProID>328</q247:QCProID></q247:CEntry><q247:CEntry><q247:DealID>0</q247:DealID><q247:ID>0</q247:ID><q247:ItemID>510004</q247:ItemID><q247:ModCode>NONE</q247:ModCode><q247:Name>Regular Fries</q247:Name><q247:QCComponent>4</q247:QCComponent><q247:QCInstanceID>723</q247:QCInstanceID><q247:QCLevel>0</q247:QCLevel><q247:QCProID>328</q247:QCProID></q247:CEntry><q247:CEntry><q247:DealID>0</q247:DealID><q247:ID>0</q247:ID><q247:ItemID>510001</q247:ItemID><q247:ModCode>NONE</q247:ModCode><q247:Name>Coleslaw Salad Small</q247:Name><q247:QCComponent>5</q247:QCComponent><q247:QCInstanceID>723</q247:QCInstanceID><q247:QCLevel>0</q247:QCLevel><q247:QCProID>328</q247:QCProID></q247:CEntry><q247:CEntry><q247:DealID>0</q247:DealID><q247:ID>0</q247:ID><q247:ItemID>600002</q247:ItemID><q247:ModCode>NONE</q247:ModCode><q247:Name>Pepsi Regular</q247:Name><q247:QCComponent>6</q247:QCComponent><q247:QCInstanceID>723</q247:QCInstanceID><q247:QCLevel>0</q247:QCLevel><q247:QCProID>328</q247:QCProID></q247:CEntry></q247:Entries><q247:Notes xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\"><q247:CNote><q247:NT_FREE_TEXT>Test Orders - Appinventiv : 5e90719d7775ec0aae8e85ac</q247:NT_FREE_TEXT><q247:NT_ID>1586524575498</q247:NT_ID></q247:CNote></q247:Notes><q247:OrderID xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\">0</q247:OrderID><q247:OrderMode xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\">1</q247:OrderMode><q247:OrderType xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\">0</q247:OrderType><q247:Payments xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\"><q247:CC_ORDER_PAYMENT><q247:PAY_AMOUNT>40.5</q247:PAY_AMOUNT><q247:PAY_STATUS>1</q247:PAY_STATUS><q247:PAY_STORE_TENDERID>252</q247:PAY_STORE_TENDERID><q247:PAY_SUB_TYPE>2</q247:PAY_SUB_TYPE><q247:PAY_TYPE>2</q247:PAY_TYPE></q247:CC_ORDER_PAYMENT></q247:Payments><q247:ProvinceID xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\">7</q247:ProvinceID><q247:ServiceCharge xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\">6.5</q247:ServiceCharge><q247:StoreID xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\">1219</q247:StoreID><q247:StreetID xmlns:q247=\"http://schemas.datacontract.org/2004/07/SDM_SDK\">315</q247:StreetID></order><autoApprove>true</autoApprove><useBackupStoreIfAvailable>true</useBackupStoreIfAvailable><orderNotes1>0</orderNotes1><orderNotes2>5e90719d7775ec0aae8e85ac</orderNotes2><creditCardPaymentbool>false</creditCardPaymentbool><isSuspended>false</isSuspended><menuTemplateID>17</menuTemplateID></UpdateOrder></soap:Body></soap:Envelope>